In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "name":["Agam","Aastha","Saksham","Kirtan"],
    "marks":[33,98,97,96],
    "city":["Raj","Mars","Amrica","Goodquestion"]
}

In [3]:
df = pd.DataFrame(dict1)

**DataFrame is equivalent to an excel sheet**

In [4]:
df

      name  marks          city
0     Agam     33           Raj
1   Aastha     98          Mars
2  Saksham     97        Amrica
3   Kirtan     96  Goodquestion

In [5]:
df.to_csv('Hi.csv')

In [6]:
df = pd.DataFrame(dict1,index=[x for x in range(2,6)])

In [7]:
df

      name  marks          city
2     Agam     33           Raj
3   Aastha     98          Mars
4  Saksham     97        Amrica
5   Kirtan     96  Goodquestion

In [8]:
df = pd.DataFrame(dict1,index=None)

In [9]:
df

      name  marks          city
0     Agam     33           Raj
1   Aastha     98          Mars
2  Saksham     97        Amrica
3   Kirtan     96  Goodquestion

In [10]:
df.to_csv('Without_index.csv',index=False)

In [11]:
df.head(2)

     name  marks  city
0    Agam     33   Raj
1  Aastha     98  Mars

In [12]:
df.tail(2)

      name  marks          city
2  Saksham     97        Amrica
3   Kirtan     96  Goodquestion

In [13]:
df.describe()

           marks
count   4.000000
mean   81.000000
std    32.010415
min    33.000000
25%    80.250000
50%    96.500000
75%    97.250000
max    98.000000

In [14]:
agam = pd.read_csv("Hi.csv")
from numbers_parser import Document
agam2=Document("Agam2.numbers")

In [15]:
agam

   Unnamed: 0     name  marks          city
0           0     Agam     33           Raj
1           1   Aastha     98          Mars
2           2  Saksham     97        Amrica
3           3   Kirtan     96  Goodquestion

In [16]:
agam['marks']

0    33
1    98
2    97
3    96
Name: marks, dtype: int64

In [17]:
agam['marks'][0]

33

In [18]:
agam['marks'][0]=20

/var/folders/ct/kcvr8z_n361cb4kp_z0mhbjm0000gn/T/ipykernel_35681/74522859.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [19]:
agam['marks'][0]

20

In [20]:
agam.to_csv("Part2.csv")

In [21]:
agam.index=['a','b','c','d']

In [22]:
agam

   Unnamed: 0     name  marks          city
a           0     Agam     20           Raj
b           1   Aastha     98          Mars
c           2  Saksham     97        Amrica
d           3   Kirtan     96  Goodquestion

In [23]:
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}
df = pd.DataFrame(data)
df.index=[a for a in"abc"]
print(df)

   calories  duration
a       420        50
b       380        40
c       390        45

In [24]:
#Creating a series from array

import pandas as pd
# as we are using array() 
import numpy as np
 
data = np.array(['p','a','n','d','a','s'])
 
ser1 = pd.Series(data)
print(ser1)

# Creating a series from Lists:
list = ['p', 'a', 'n', 'd', 'a' ,'s']
  
ser2 = pd.Series(list)
print(ser2)

# Accessing Element from Series with Position 
print(ser2[:3])

0    p
1    a
2    n
3    d
4    a
5    s
dtype: object
0    p
1    a
2    n
3    d
4    a
5    s
dtype: object
0    p
1    a
2    n
dtype: object

In [25]:
data=["Indian","Institute","Of","Technology","Bombay"]

ser3=pd.Series(data)
print(ser3)

0        Indian
1     Institute
2            Of
3    Technology
4        Bombay
dtype: object

In [26]:
ser4=pd.Series(data,index=["a","b","c","d","e"])
print(ser4)

#Label can be used to access a specified value

print(ser4["d"])

a        Indian
b     Institute
c            Of
d    Technology
e        Bombay
dtype: object
Technology

In [27]:
calories = {"day1": 420, "day2": 380, "day3": 390}

myvar = pd.Series(calories)

print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [31]:
import pandas as pd
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}
df = pd.DataFrame(data)

#Return row 0
print(df.loc[0])

#Return row 0 and 1
print(df.loc[[0,1]])

calories    420
duration     50
Name: 0, dtype: int64
   calories  duration
0       420        50
1       380        40

In [32]:
df=pd.DataFrame(data,index=["day1","day2","day3"])
print(df.loc["day1"])

calories    420
duration     50
Name: day1, dtype: int64

In [33]:
# Finding the mean and Standard Deviation of a Pandas Series.

import pandas as pd
  
# creating a series
s = pd.Series(data = [5, 9, 8, 5, 7, 8, 1, 2, 3,
                      4, 5, 6, 7, 8])

# displaying the series
print(s)
# finding the mean
print(s.mean())
# finding the Standard deviation
print(s.std())
# finding the variance
print(s.var())

0     5
1     9
2     8
3     5
4     7
5     8
6     1
7     2
8     3
9     4
10    5
11    6
12    7
13    8
dtype: int64
5.571428571428571
2.4405007592795287
5.956043956043955

In [34]:
#Finding the mean and Standard Deviation of a Pandas DataFrame.

import pandas as pd

# creating a dataframe 
df = pd.DataFrame({'Cost':[114, 345, 15778, 5626],
                   'Quantity':[10, 20, 50,30]})
  
# displaying the DataFrame
print(df)
# finding the mean
print(df.mean())
# finding the Standard deviation
print(df.std())
# finding the variance
print(df.var())

    Cost  Quantity
0    114        10
1    345        20
2  15778        50
3   5626        30
Cost        5465.75
Quantity      27.50
dtype: float64
Cost        7331.018318
Quantity      17.078251
dtype: float64
Cost        5.374383e+07
Quantity    2.916667e+02
dtype: float64